{
  "name": "System Goals",
  "description": "A taxonomy of high-level, domain-facing goals and use cases that an AI / Machine system may tackle during its operation.",
  "children": [
    {
      "name": "Administrative, Financial and Market-related Goals",
      "description": "General computational processing goals that do not necessarily involve the usage of AI and ML.",
      "children": [
        {
          "name": "Resource Allocation",
          "description": "The task of deciding the distribution of a limited resource to multiple recipients."
        },
        {
          "name": "Regulatory Monitoring",
          "description": "The task of checking and/or verifying compliance to specified rules and regulations by automatically examining relevant records."
        },
        {
          "name": "Financial Processing",
          "description": "Goals geared towards the estimation of financial quantities."
        },
        {
          "name": "Underwriting",
          "description": "The task of risk assessment, analysis and evaluation in the context of financial transactions."
        },
        {
          "name": "Product Naming and Description",
          "description": "The task of coming up with marketable product names, titles and descriptions, e.g. in an e-shop."
        },
        {
          "name": "Ad Delivery",
          "description": "The effective selection and delivery of advertisements, promotional material and personalized marketing media."
        },
        {
          "name": "Market Forecasting",
          "description": "The class of goals that generate quantitative estimates of market quantities (e.g. traffic, demand, price, etc.)."
        },
        {
          "name": "Automatic Stock Trading",
          "description": "The goal of automatically valuing and performing transactions in the stock market."
        },
        {
          "name": "Value Estimation",
          "description": "The goal of automatically estimating the monetary value of a good or service."
        },
        {
          "name": "Personalized Pricing",
          "description": "The goal of determining product prices for an individual based on their personal data."
        },
        {
          "name": "Scheduling",
          "description": "The goal of planning and constructing schedules for optimizing desired quantities (e.g. throughput, revenue, clicks) given existing constaints."
        },
        {
          "name": "Application Evaluation",
          "description": "The goal of evaluating an application for a position (e.g. for employment, study, etc.) via automatic means."
        },
        {
          "name": "Automatic Skill Assessment",
          "description": "The goal of automatically estimating employee skills."
        },
        {
          "name": "Cashierless Shopping",
          "description": "The goal of facilitating automated shopping with limited to no in-store personnel."
        },
        {
          "name": "Workforce Monitoring and Evaluation",
          "description": "The goal of monitoring and tracking the behaviour and performance employees."
        },
        {
          "name": "Workforce Administration",
          "description": "The goal of automatically managing employee-related tasks, issues and operations."
        },
        {
          "name": "Product Recommendation",
          "description": "The goal of automatically recommending e-shop products to users."
        },
        {
          "name": "Marketing Analytics Generation",
          "description": "The goal of generating data-driven insights for marketing purposes."
        }
      ]
    },
    {
      "name": "Risk Assessment",
      "description": "Goals consisting of calculating risk.",
      "children": [
        {
          "name": "Child Welfare Risk Assessment",
          "description": "The goal of assessing the risk of harm, neglect, or abuse in child welfare cases using predictive or data-driven techniques to inform decisions about intervention."
        }
      ]
    },
    {
      "name": "Behavioral Modeling",
      "description": "The goal of modeling, estimating and tracking human behaviour in domains of interest.",
      "children": [
        {
          "name": "Recidivism Prediction",
          "description": "The goal of producing recidivism risk estimates for incarcerated population."
        },
        {
          "name": "Activity Tracking",
          "description": "The goal of tracking and monitoring of human activities via smart equipment, wearables, etc."
        },
        {
          "name": "Team Coordination",
          "description": "The goal coordinating, planning, scheduling and overseeing team activities and tasks."
        },
        {
          "name": "Predictive Policing",
          "description": "The management and allocation of police resources based on crime-related predictions and forecasing."
        },
        {
          "name": "Substance Abuse Prediction",
          "description": "Prediction of human behaviour related to consumption of controlled substances."
        },
        {
          "name": "Trustworthiness scoring",
          "description": "The task of assessing the trustworthiness of individuals, given their online presence."
        }

      ]
    },
    {
      "name": "Object Detection",
      "description": "The goal of locating objects of interest in an input receptive field.",
      "children": [
        {
          "name": "Audio Detection",
          "description": "Goals including detection of auditory concepts in an audio signal.",
          "children": [
            {
              "name": "Gunshot Detection",
              "description": "The goal of detecting gunshot sounds."
            },
            {
              "name": "Audio Localization",
              "description": "The goal of determining the source location of audio signals."
            },
            {
              "name": "Cheating Detection",
              "description": "The goal of monitoring human activity to detect cheating behaviour."
            }
          ]
        },
        {
          "name": "Substance Detection",
          "description": "Goals related to detecting chemical substances with the use of specialized sensors."
        },
        {
          "name": "License Plate Recognition",
          "description": "The goal of automatically reading car license plates."
        },
        {
          "name": "Speed Estimation",
          "description": "The goal of estimating an object's speed."
        }
      ]
    },
    {
      "name": "Information Retrieval",
      "description": "The goal of selecting data instances relevant to an input query, from an available pool of candidates.",
      "children": [
        {
          "name": "Content Recommendation",
          "description": "Automatic retrieval and serving of content to a user based on their profile, preferences, activity and/or history."
        },
        {
          "name": "Matchmaking",
          "description": "Goals of matching and recommendation of personal profiles for online dating."
        },
        {
          "name": "Content Search",
          "description": "Automatic retrieval and serving of content to a user based on an explicitly supplied query."
        },
        {
          "name": "Data Grouping",
          "description": "The goal of building groups of semantically contiguous elements."
        }
      ]
    },
    {
      "name": "Natural Language Processing / Understanding Goals",
      "description": "Goals involving the intelligent processing, reasoning and manipulation of text.",
      "children": [
        {
          "name": "Spam Filtering",
          "description": "The task of automatically tagging and filtering out spam content."
        },
        {
          "name": "Writing Assistant",
          "description": "The goal of providing real-time suggestions for grammar, style, structure, clarity, etc., of written text."
        },
        {
          "name": "Fact Checking",
          "description": "The goal of determining the veracity of a statement laid out in text."
        },
        {
          "name": "Sentiment Analysis",
          "description": "Automatic assignment of sentiment scores to text."
        },
        {
          "name": "Translation",
          "description": "Automatic translation of text from a source to a target language."
        },
        {
          "name": "Question Answering",
          "description": "The goal of automatically providing relevant and accurate responses to questions."
        },
        {
          "name": "Chatbot",
          "description": "The goal of deploying an AI NLP system to engage in sequential dialogue and conversation."
        }
      ]
    },
    {
      "name": "Computer Vision Goals",
      "description": "System goals related to analysis and manipulation of visual modalities",
      "children": [
        {
          "name": "Smart Surveillance",
          "description": "The task of AI-assisted surveillance."
        },
        {
          "name": "Image Upscaling",
          "description": "The task of increasing the resolution of an input image."
        },
        {
          "name": "Video Tagging",
          "description": "The task of automatically assigning semantic labels to a video."
        },
        {
          "name": "Image Verification",
          "description": "The task of automatically rejecting or accepting an image for a domain-specific task."
        },
        {
          "name": "Camera Tracking",
          "description": "The task of automatically moving the camera view in order to follow points of interest in a live video feed."
        },
        {
          "name": "Image Description",
          "description": "The task of generating a textual description of the visual content of an image."
        },
        {
          "name": "Image Cropping",
          "description": "The automatic selection of an image subset that contains the most salient content of the entire image."
        },
        {
          "name": "Image Scoring",
          "description": "The goal of associating images with some numerical value, corresponding to domain-specific quanitities of interest."
        },
        {
          "name": "Image Tagging",
          "description": "The goal of attaching semantic labels to an image based on its semantic contents."
        },
        {
          "name": "Face Recognition",
          "description": "The goal of automatically recognizing a human face in media content, out of a set of reference candidates."
        },
        {
          "name": "Threat Detection",
          "description": "Goals centered around identifying threat objects and events."
        }
      ]
    },
    {
      "name": "Smart Devices",
      "description": "Goals that include usage of AI technology for automation, interconnected devices, IoT, 'smart' living, etc..",
      "children": [
        {
          "name": "AI Voice Assistant",
          "description": "The joint usage of multiple AI technologies (audio recognition and transcription, text generation, speech synthesis, text to speech, etc.) for automated voice assistance functionality."
        },
        {
          "name": "Navigation Assistant",
          "description": "The goal of plotting routes from a starting point to a destination and assisting navigation."
        },
        {
          "name": "Flight Assistance",
          "description": "The goal of assisting pilots to navigate and manage aircraft via instructional feedback, and sensor data, etc.."
        }
      ]
    },
    {
      "name": "Synthetic Content Generation",
      "description": "Goals that generate high-quality content via automatic means.",
      "children": [
        {
          "name": "Game Content Generation",
          "description": "The task of automatic content generation for video games."
        },
        {
          "name": "Voice Generation",
          "description": "The automatic generation of synthetic but realistic human voices."
        },
        {
          "name": "Predictive Typing",
          "description": "The generation of appropriate words, sentences or text snippets, given an existing context."
        },
        {
          "name": "Text Style Replication",
          "description": "The automatic generation of text, tuned to mimic the content and/or writing style of a specific creator or a specific use case."
        },
        {
          "name": "Technical Text Generation",
          "description": "The automatic generation of text for technical use cases, aimed for accuracy, clarity and high-quality informative content."
        },
        {
          "name": "Code Generation",
          "description": "The automatic generation and suggestion of code snippets from a current code context."
        },
        {
          "name": "Social Media Content Generation",
          "description": "The automatic generation of social media text (e.g. posts, comments, etc.) from a seed prompt, tailored for user engagement."
        },
        {
          "name": "Deepfake Video Generation",
          "description": "The automatic generation of videos that imitate the face, voice and mannerisms of individuals."
        },
        {
          "name": "Visual Art Generation",
          "description": "The automatic generation of digital art images."
        },
        {
          "name": "Image Retouching",
          "description": "The task of automatic image processing to enhance its aesthetics by the application of high-level filters (e.g. color filters) and transformations (e.g. 'beautify' filters)."
        }
      ]
    },
    {
      "name": "Automated Content Curation",
      "description": "Goals that estimate how suitable / appropriate content is for the target domain, audience or context.",
      "children": [
        {
          "name": "Hate Speech Detection",
          "description": "The detection of hateful language (e.g. chauvinism / discrimination against race, religion, gender, etc.) in text."
        },
        {
          "name": "NSFW Content Detection",
          "description": "The goal of gauging whether text or multimedia content is safe for work or not (e.g. whether it contains graphic, violent, adult content)."
        },
        {
          "name": "Copyrighted Content Detection",
          "description": "The goal of detecting / identifying the presence of copyrighted content elements in input data."
        },
        {
          "name": "Automatic Copy-Editing",
          "description": "The goal of maintenance, quality assurance and copy-editing of digital text via the use of automated systems."
        }
      ]
    },
    {
      "name": "Robotics and Autonomous Systems",
      "description": "Goals involving robotic actuators and/or autonomous robots",
      "children": [
        {
          "name": "Robotic Manipulation",
          "description": "The goal of manipulating physical objects via robotic actuators (e.g. robotic arms, industrial manipulators, highly autonomous assembly lines, etc.)."
        },
        {
          "name": "Autonomous Drones",
          "description": "Goals involving autonomous drone robots (e.g. such as Boston Dynamics robots)."
        },
        {
          "name": "Autonomous Driving",
          "description": "The goal of autonomous, driverless vehicle operation."
        },
        {
          "name": "Game AI",
          "description": "Goals that include systems that play games autonomously."
        }
      ]
    },
    {
      "name": "Decision Support Systems",
      "description": "Goals assisting humans into making decisions, judgements and reaching informed conclusions.",
      "children": [
        {
          "name": "Judicial Decision Support",
          "description": "Goals including the use of AI for assisting medical diagnosis."
        },
        {
          "name": "Medical Diagnosis Support",
          "description": "Goals including the use of AI for assisting medical diagnosis."
        }
      ]
    },
    {
      "name": "Miscellaneous Goals",
      "description": "Goals not included in any category above.",
      "children": [
        {
          "name": "Accessibility Assurance",
          "description": "Goals involved in making interfaces, products, systems, etc., accessible to differently-abled users."
        },
        {
          "name": "Gender Identification",
          "description": "Goals providing personalized health-related services, advice and recommendations."
        },
        {
          "name": "Health AI Assistant",
          "description": "Goals providing personalized health-related services, advice and recommendations."
        },
        {
          "name": "Malware Detection",
          "description": "Goals involving the detection of malicious software in a computer system."
        },
        {
          "name": "Automatic Fault Handling",
          "description": "The goal of automatically monitoring for, detecting and resolving faults in a complex environment."
        },
        {
          "name": "Identification",
          "description": "The goal of determining the identity of an individual."
        }

      ]
    }
  ]
}
