{
  "name": "Methods and Technologies",
  "description": "A taxonomy of methods and technologies that may be used to implement AI / ML system tasks and use cases",
  "children": [
    {
      "name": "Neural Network",
      "description": "A learning model composed of artificial neurons organized into nonlinear computational circuits",
      "children": [
        {
          "name": "Transformer",
          "description": "A neural network that relies on attention mechanisms to build representations."
        },
        {
          "name": "Convolutional Neural Network",
          "description": "A neural network that utilizes convolution operations via learnable filter banks, applied on limited receptive fields of their inputs."
        },
        {
          "name": "Recurrent Neural Network",
          "description": "A class of neural networks used for modeling sequential data, utilizing memory and recursion to capture temporal dynamics emergent in the input."
        },
        {
          "name": "Generative Adversarial Network",
          "description": "A class of neural networks used for data generation, employing generator and discriminator components to produce synthetic data with high fidelity."
        },
        {
          "name": "Siamese Network",
          "description": "A neural network that uses shared weights on dual inputs, to produce output representations that optimize a distance / similarity relation."
        },
        {
          "name": "Autoencoder",
          "description": "A neural network trained to optimize low-dimensional representation bottlenecks with input recostruction objectives."
        }
      ]
    },
    {
      "name": "Computer Vision Methods and Technologies",
      "description": "Methods and technologies used under the computer vision domain.",
      "children": [
        {
          "name": "Gesture Recognition",
          "description": "Techniques involving identifying specific hand movements and gestures for smart user control."
        },
        {
          "name": "Image Segmentation",
          "description": "The approach of partitioning an image to semantically contiguous regions"
        },
        {
          "name": "3D reconstruction",
          "description": "The task of computating the 3-dimensional geometric attributes of real objects from partial data."
        },
        {
          "name": "Face Detection",
          "description": "The detection of human faces in visual content."
        },
        {
          "name": "Optical Character Recognition",
          "description": "The use of image processing and computer vision techniques in order to extract text from images, document pdfs and other visual media."
        },
        {
          "name": "Satellite Imaging",
          "description": "The use of imaging satellites for earth observation image data acquisition."
        },
        {
          "name": "Image Classification",
          "description": "The use of image representation and classification techniques to detect concepts in images."
        }
      ]
    },
    {
      "name": "Natural Language Processing Methods and Technologies",
      "description": "Methods and technologies commonly utilized for text analysis",
      "children": [
        {
          "name": "Character NGrams",
          "description": "The approach of using character-level ngrams to build text representations"
        },
        {
          "name": "Language Modeling",
          "description": "The approach of building a statistical model of word co-occurence associations via predicting missing words in a context."
        },
        {
          "name": "Keyword Filtering",
          "description": "Methods of statically restricting keywords from participating in input / output sets of a task."
        }
      ]
    },
    {
      "name": "Audio Analysis Methods and Technologies",
      "description": "Methods and technologies utilized in audio analysis systems",
      "children": [
        {
          "name": "Automatic Speech Recognition",
          "description": "The process of automatically transcribing human speech from audio."
        },
        {
          "name": "Speaker Diarization",
          "description": "The approach of identifying separate speakers from conversations in input audio."
        },
        {
          "name": "Acoustic Fingerprint",
          "description": "The generation of short summaries from audio signals for rapid retrieval and recognition."
        },
        {
          "name": "Spectrogram",
          "description": "The use of spectrogram features for audio representation."
        },
        {
          "name": "Acoustic Triangulation",
          "description": "A process that determines the distance and/or orientation of an audio signal using multiple sensors placed at different locations."
        }
      ]
    },
    {
      "name": "Machine Learning Methods",
      "description": "Broad methods and techniques used for ML model building",
      "children": [
        {
          "name": "Ensemble Aggregation",
          "description": "Approaches where outputs of multiple (distinct and individual) learners are collectively considered (e.g. via aggregation, fusion, voting, pooling ,etc.) to produce a final prediction."
        },
        {
          "name": "Intermmediate modeling",
          "description": "The approach uses an attainable, intermmediate proxy modeling Y, to obtain desired outputs Z from inputs X due to existing limitations."
        },
        {
          "name": "Multimodal Learning",
          "description": "The paradigm where multiple data modalities (e.g. text, audio, images) are utilized for learning and problem-solving."
        },
        {
          "name": "Unsupervised Learning",
          "description": "The approach of modeling data patterns and structure without usage of ground truth.",
          "children": [
            {
              "name": "Clustering",
              "description": "The unsupervised task of grouping data instances into groups with high internal similarity and low similarity across different groups."
            },
            {
              "name": "Collaborative Filtering",
              "description": "Methods where user representations are built from attributes, history, activity, etc. and utilized for producing recommendations based on preferences of similar users."
            },
            {
              "name": "Content-based Filtering",
              "description": "Approaches that generate recommendations by focusing on data item content, properties and metadata rather than user-oriented attributes."
            },
            {
              "name": "Distributional Learning",
              "description": "An approach of arriving at representations (usually vectorial embeddings) of objects from unlabelled data via analyzing its co-occurence distributions."
            }
          ]
        },
        {
          "name": "Supervised Learning",
          "description": "Learning methods facilitating training with ground truth.",
          "children": [
            {
              "name": "Regression",
              "description": "The task of annotating data with real-valued predictions."
            },
            {
              "name": "Classification",
              "description": "The task of annotating data to one or more semantic labels from a given labelset."
            }
          ]
        }
      ]
    },
    {
      "name": "Other domain-specific approaches",
      "description": "Popular methods mostly relevant to specific domains",
      "children": [
        {
          "name": "Geolocation",
          "description": "Estimation and usage of the geographic coordinates for related tasks (e.g. navigation)."
        },
        {
          "name": "Diverse Data",
            "description": "The use of different, diverse data types and formats (e.g. numeric, conceptual, categorical) etc. rather than direct mining of digitized inputs (e.g. image, audio, text, etc.)."
        }
      ]
    }
  ]
}
